In [1]:
# Load library 
import numpy as np
import pandas as pd

In [2]:
# Load libarary
import pandas as pd
import numpy as np
from IPython.display import display

# Membuat Series
number_list = pd.Series([1, 2, 3, 4, 5, 6])
string_list = pd.Series(["Usep","Syaikal","Arifin"])
display(number_list)
display(string_list)

# Membuat Dataframe
matrix = [[1, 2, 3],
           ["a","b","c"],
           [3, 4, 5],
           ["d", 4, 6]]
matrix_list = pd.DataFrame(matrix)
display(matrix_list)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

0       Usep
1    Syaikal
2     Arifin
dtype: object

   0  1  2
0  1  2  3
1  a  b  c
2  3  4  5
3  d  4  6

In [3]:
# Load library atau modul
import pandas as pd
import numpy as np

# Membuat series
number_series = pd.Series([1, 2, 3, 4, 5, 6])
string_series = pd.Series(["a","b","c","d","e"])
display(number_list)
display(string_list)

# Membuat dataframe
matrix = [[1, 2, 3],
           ["a","b","c"],
           [3, 4, 5],
           ["d", 4, 6]]
matrix_list = pd.DataFrame(matrix)
display(matrix_list)

# 1. Attribute -> info()
print("[1] Attribute Info -> .info()")
display(matrix_list.info())

# 2. Attribute -> .shape
print("[2] Attribute Shape -> .shape")
display("Dimensi series = %d Baris"%number_list.shape)
display("Dimensi series = %d Baris"%string_list.shape)
display("Dimensi Dataframe = %d Baris & %d Kolom"%matrix_list.shape)

# 3. Attribute -> .dtypes
print("[3] Attribute Dtypes -> .dtypes")
display(number_list.dtypes)
display(string_list.dtypes)
display(matrix_list.dtypes)

# 4. Attribute -> .astype()
print("[4] Attribute Astype - .astype()")
display(number_list.astype("str"))
display(string_list.astype("str"))
display(matrix_list.astype("str"))

display(number_list.dtypes)
display(string_list.dtypes)
display(matrix_list.dtypes)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

0       Usep
1    Syaikal
2     Arifin
dtype: object

   0  1  2
0  1  2  3
1  a  b  c
2  3  4  5
3  d  4  6

[1] Attribute Info -> .info()
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       4 non-null      object
 1   1       4 non-null      object
 2   2       4 non-null      object
dtypes: object(3)
memory usage: 224.0+ bytes

None

[2] Attribute Shape -> .shape

'Dimensi series = 6 Baris'

'Dimensi series = 3 Baris'

'Dimensi Dataframe = 4 Baris & 3 Kolom'

[3] Attribute Dtypes -> .dtypes

dtype('int64')

dtype('O')

0    object
1    object
2    object
dtype: object

[4] Attribute Astype - .astype()

0    1
1    2
2    3
3    4
4    5
5    6
dtype: object

0       Usep
1    Syaikal
2     Arifin
dtype: object

   0  1  2
0  1  2  3
1  a  b  c
2  3  4  5
3  d  4  6

dtype('int64')

dtype('O')

0    object
1    object
2    object
dtype: object

In [4]:
# Load modul atau library
import pandas as pd
import numpy as np

# Membuat series
number_list = pd.Series([1, 2, 3, 4, 5, 6])
# Membuat dataframe
matrix = [[1, 2, 3],
          ["a","b","c"],
          [3, 4, 5],
          ["d", 4, 6]]
matrix_list = pd.DataFrame(matrix)

# 5. Attribute -> .copy()
print("Attribute Copy ->.copy()")
copy_number_list = number_list.copy()
copy_matrix_list = matrix_list.copy()
display(copy_number_list)
display(copy_matrix_list)

# 6. Attribute -> .to_list()
print("Attribute To List -> .to_list()")
display(number_list.to_list())

# 7. Attribute -> .unique()
print("Attribute Unique -> .unique()")
display(number_list.unique())

Attribute Copy ->.copy()

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

   0  1  2
0  1  2  3
1  a  b  c
2  3  4  5
3  d  4  6

Attribute To List -> .to_list()

[1, 2, 3, 4, 5, 6]

Attribute Unique -> .unique()

array([1, 2, 3, 4, 5, 6], dtype=int64)

In [5]:
import pandas as pd
import numpy as np

# Membuat series
number_list = pd.Series([1, 2, 3, 4, 5, 6])

# Membuat Dataframe
matrix = [[1, 2, 3],
          ["a","b","c"],
          [3, 4, 5],
          ["d", 4, 6]]
matrix_list = pd.DataFrame(matrix)

# 8. Attribute Index -> .index
print("Attribute Index -> .index")
display(number_list.index)
display(matrix_list.index)

# 9. Attribute Column -> .columns
print("Attribute Column -> .columns")
display(matrix_list.columns)

# 10. Attribute Loc -> .loc
print("Attribute Loc -> .loc[baris, kolom]")
display(number_list.loc[0:1])
display(matrix_list.loc[0:2, 0:1])

# 11. Attribute iLoc -> .iloc
print("Attribute iLoc -> .iloc[]")
display(number_list.iloc[0:1])
display(matrix_list.iloc[0:1])
display(matrix_list.iloc[0:2,2])
display(matrix_list.iloc[0:3])

Attribute Index -> .index

RangeIndex(start=0, stop=6, step=1)

RangeIndex(start=0, stop=4, step=1)

Attribute Column -> .columns

RangeIndex(start=0, stop=3, step=1)

Attribute Loc -> .loc[baris, kolom]

0    1
1    2
dtype: int64

   0  1
0  1  2
1  a  b
2  3  4

Attribute iLoc -> .iloc[]

0    1
dtype: int64

   0  1  2
0  1  2  3

0    3
1    c
Name: 2, dtype: object

   0  1  2
0  1  2  3
1  a  b  c
2  3  4  5

# Creating Series & Dataframe from list

In [6]:
import pandas as pd
import numpy as np

# Creating series from list
ex_list = ["a", 1, 2, 3, "b", "c"]
ex_series = pd.Series(ex_list)
display(ex_series)

# Creating dataframe from list of list
ex_list_of_list = [[1, "a", "b", "c"],
                    [2.5, "d", "e", "f"],
                    [5, "g", "h", "i"],
                    [7.5, "j", 10.5, "l"]]
index = ["dq", "lab", "kar", "lan"]
cols = ["float", "char", "obj", "char"]
ex_df = pd.DataFrame(ex_list_of_list, index=index, columns=cols)
display(ex_df)

0    a
1    1
2    2
3    3
4    b
5    c
dtype: object

     float char   obj char
dq     1.0    a     b    c
lab    2.5    d     e    f
kar    5.0    g     h    i
lan    7.5    j  10.5    l

# Creating Series & Dataframe from Dictionary

In [7]:
import pandas as pd
import numpy as np

# 1. Creating series from dictionary
dict_series = {"1" : "a",
               "2" : "b",
               "3" : "c"}
ex_series = pd.Series(dict_series)
display(ex_series)

# 2. Creating dataframe from dictionary
df_series = {"1" : ["a", "b", "c"],
             "2" : ["b", "c", "d"],
             "3" : [2, 3, "z"]}
ex_dataframe = pd.DataFrame(df_series)
display(ex_dataframe)

1    a
2    b
3    c
dtype: object

   1  2  3
0  a  b  2
1  b  c  3
2  c  d  z

# Creating Series & Dataframe from Numpy Array

In [8]:
import pandas as pd
import numpy as np

# Creating series from numpy array (1D)
arr_series = np.array([1,2,3,4,5,6,6,7])
ex_series = pd.Series(arr_series)
display(ex_series)

# Creating dataframe from numpy array (2D)
arr_df = np.array([[1, 2, 3, 5],
                  [5, 6, 7, 8],
                  ["a", "b", "c", 10]])
ex_df = pd.DataFrame(arr_df)
display(ex_df)

0    1
1    2
2    3
3    4
4    5
5    6
6    6
7    7
dtype: int32

   0  1  2   3
0  1  2  3   5
1  5  6  7   8
2  a  b  c  10

# Dataset I/O

In [9]:
# Load library atau modul
import pandas as pd
from IPython.display import display

# Load dataset file csv
df_csv = pd.read_csv("https://dqlab-dataset.s3-ap-southeast-1.amazonaws.com/sample_csv.csv")
# df_csv.to_csv(r"D:\Usep Syaikal Arifin\Computer Programming\Python Programming Language\DQLab-Academy-Course-Online\Kelas Fundamental\Data Manipulation With Pandas - Part 1\File Dokumentasi\File CSV\sample_csv.csv", index=None, header=True)
# df_csv.to_excel(r"D:\Usep Syaikal Arifin\Computer Programming\Python Programming Language\DQLab-Academy-Course-Online\Kelas Fundamental\Data Manipulation With Pandas - Part 1\File Dokumentasi\File Excel\sample_csv.xlsx", index=None, header=True)
display(df_csv.head(5))

# Load dataset file tsv
df_tsv = pd.read_csv("https://storage.googleapis.com/dqlab-dataset/sample_tsv.tsv", sep="\t")
# df_tsv.to_csv(r"D:\Usep Syaikal Arifin\Computer Programming\Python Programming Language\DQLab-Academy-Course-Online\Kelas Fundamental\Data Manipulation With Pandas - Part 1\File Dokumentasi\File CSV\sample_tsv.csv", index=None, header=True)
# df_tsv.to_excel(r"D:\Usep Syaikal Arifin\Computer Programming\Python Programming Language\DQLab-Academy-Course-Online\Kelas Fundamental\Data Manipulation With Pandas - Part 1\File Dokumentasi\File Excel\sample_tsv.xlsx", index=None, header=True)
display(df_tsv.head(5))

# Load dataset file excel
df_excel = pd.read_excel("https://storage.googleapis.com/dqlab-dataset/sample_excel.xlsx", sheet_name="test")
# df_excel.to_csv(r"D:\Usep Syaikal Arifin\Computer Programming\Python Programming Language\DQLab-Academy-Course-Online\Kelas Fundamental\Data Manipulation With Pandas - Part 1\File Dokumentasi\File CSV\sample_excel.csv", index=None, header=True)
# df_excel.to_excel(r"D:\Usep Syaikal Arifin\Computer Programming\Python Programming Language\DQLab-Academy-Course-Online\Kelas Fundamental\Data Manipulation With Pandas - Part 1\File Dokumentasi\File Excel\sample_excel.xlsx", index=None, header=True)
display(df_excel.head(5))

# Load dataset file JSON
url = "https://storage.googleapis.com/dqlab-dataset/covid2019-api-herokuapp-v2.json"
df_json = pd.read_json(url)
# df_json.to_csv(r"D:\Usep Syaikal Arifin\Computer Programming\Python Programming Language\DQLab-Academy-Course-Online\Kelas Fundamental\Data Manipulation With Pandas - Part 1\File Dokumentasi\File CSV\sample_json.csv", index=None, header=True)
# df_json.to_excel(r"D:\Usep Syaikal Arifin\Computer Programming\Python Programming Language\DQLab-Academy-Course-Online\Kelas Fundamental\Data Manipulation With Pandas - Part 1\File Dokumentasi\File Excel\sample_json.xlsx", index=None, header=True)
display(df_json.head(10))

,order_id,order_date,customer_id,city,province,product_id,brand,quantity,item_price
0,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0648,BRAND_C,4,1934000
1,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3826,BRAND_V,8,604000
2,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1508,BRAND_G,12,747000
3,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0520,BRAND_B,12,450000
4,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1513,BRAND_G,3,1500000

,order_id,order_date,customer_id,city,province,product_id,brand,quantity,item_price
0,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0648,BRAND_C,4,1934000
1,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3826,BRAND_V,8,604000
2,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1508,BRAND_G,12,747000
3,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0520,BRAND_B,12,450000
4,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1513,BRAND_G,3,1500000

,order_id,order_date,customer_id,city,province,product_id,brand,quantity,item_price
0,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0648,BRAND_C,4,1934000
1,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3826,BRAND_V,8,604000
2,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1508,BRAND_G,12,747000
3,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0520,BRAND_B,12,450000
4,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1513,BRAND_G,3,1500000

                                                data          dt          ts
0  {'location': 'US', 'confirmed': 3363056, 'deat...  07-14-2020  1594684800
1  {'location': 'Brazil', 'confirmed': 1884967, '...  07-14-2020  1594684800
2  {'location': 'India', 'confirmed': 906752, 'de...  07-14-2020  1594684800
3  {'location': 'Russia', 'confirmed': 732547, 'd...  07-14-2020  1594684800
4  {'location': 'Peru', 'confirmed': 330123, 'dea...  07-14-2020  1594684800
5  {'location': 'Chile', 'confirmed': 317657, 'de...  07-14-2020  1594684800
6  {'location': 'Mexico', 'confirmed': 304435, 'd...  07-14-2020  1594684800
7  {'location': 'United Kingdom', 'confirmed': 29...  07-14-2020  1594684800
8  {'location': 'South Africa', 'confirmed': 2877...  07-14-2020  1594684800
9  {'location': 'Iran', 'confirmed': 259652, 'dea...  07-14-2020  1594684800

# Read Dataset - SQL

In [10]:
# import mysql.connector
# import pandas as pd

# # Membuat koneksi
# my_conn = mysql.connector.connect(host="relational.fit.cvut.cz",
#                                   port = 3306,
#                                   user = "guest",
#                                   passwd = "relational",
#                                   database = "financial",
#                                   use_pure = True)

# my_query = """ SELECT * FROM loan """
# df_load = pd.read_sql_query(my_query, my_conn)
# display(df_load)

# Read Dataset - Google BigQuery

In [11]:
import pandas as pd
# query = """ SELECT * FROM 'bigquery-public-data.covid19_jhu_csse_eu.summary' LIMIT 1000; """
# df_covid19_eu_summary = pd.read_gbq(query, project_id="XXXXXXXX")
# display(df_covid19_eu_summary)

# Write dataset

Pandas menyediakan fitur demikian secara ringkas melalui penerapan method pada dataframe/series yang ditabelkan berikut ini:

Method

Code

.to_csv() → digunakan untuk export dataframe kembali ke csv atau tsv

CSV
df.to_csv("csv1.csv", index=False)
TSV
df.to_csv("tsv1.tsv", index=False, sep='\t')

.to_clipboard() → export dataframe menjadi bahan copy jadi nanti bisa tinggal klik paste di excel atau google sheets

df.to_clipboard()

.to_excel() → export dataframe menjadi file excel

df_excel.to_excel("xlsx1.xlsx", index=False)

.to_gbq() → export dataframe menjadi table di Google BigQuery

df.to_gbq("temp.test", project_id="XXXXXX", if_exists="fail")

temp: nama dataset,
test: nama table
if_exists: ketika tabel dengan dataset.table_name yang sama sudah ada, apa action yang ingin dilakukan
("fail": tidak melakukan apa-apa,
 "replace': membuang tabel yang sudah ada dan mengganti yang baru,
 "append": menambah baris di tabel tersebut dengan data yang baru
)

# Haid & Tail

In [12]:
import pandas as pd

df = pd.read_csv("https://dqlab-dataset.s3-ap-southeast-1.amazonaws.com/sample_csv.csv")
display(df.head(5))
display(df.tail(5))

,order_id,order_date,customer_id,city,province,product_id,brand,quantity,item_price
0,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0648,BRAND_C,4,1934000
1,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3826,BRAND_V,8,604000
2,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1508,BRAND_G,12,747000
3,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0520,BRAND_B,12,450000
4,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1513,BRAND_G,3,1500000

,order_id,order_date,customer_id,city,province,product_id,brand,quantity,item_price
96,1612390,2019-01-01,12681,Makassar,Sulawesi Selatan,P3388,BRAND_S,10,450000
97,1612390,2019-01-01,12681,Makassar,Sulawesi Selatan,P3082,BRAND_R,18,1045000
98,1612390,2019-01-01,12681,Makassar,Sulawesi Selatan,P3354,BRAND_S,24,450000
99,1612390,2019-01-01,12681,Makassar,Sulawesi Selatan,P3357,BRAND_S,24,450000
100,1612390,2019-01-01,12681,Makassar,Sulawesi Selatan,P0422,BRAND_B,4,1325000

# Indexing - Part 2

In [13]:
import pandas as pd
df = pd.read_csv("https://storage.googleapis.com/dqlab-dataset/sample_csv.csv", sep="\t")
display(df.index)
display(df.columns)

RangeIndex(start=0, stop=101, step=1)

Index(['order_id,order_date,customer_id,city,province,product_id,brand,quantity,item_price'], dtype='object')

# Indexing - Part 3

In [14]:
import pandas as pd

# Load dataset
df = pd.read_csv("https://dqlab-dataset.s3-ap-southeast-1.amazonaws.com/sample_tsv.tsv", sep="\t")
display(df.head(10))

# Set multi_index
df_x = df.set_index(["order_date","city","customer_id"])
display(df_x)

# Print nama dan level dari multi index
for name, level in zip(df_x.index.names, df_x.index.levels):
    print(name, " : " ,level)

,order_id,order_date,customer_id,city,province,product_id,brand,quantity,item_price
0,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0648,BRAND_C,4,1934000
1,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3826,BRAND_V,8,604000
2,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1508,BRAND_G,12,747000
3,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0520,BRAND_B,12,450000
4,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1513,BRAND_G,3,1500000
5,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3911,BRAND_V,3,2095000
6,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1780,BRAND_H,3,2095000
7,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3132,BRAND_S,3,1745000
8,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1342,BRAND_F,6,1045000
9,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P2556,BRAND_P,6,1045000

                                        order_id          province product_id  \
order_date city            customer_id
2019-01-01 Jakarta Selatan 18055         1612339       DKI Jakarta      P0648
                           18055         1612339       DKI Jakarta      P3826
                           18055         1612339       DKI Jakarta      P1508
                           18055         1612339       DKI Jakarta      P0520
                           18055         1612339       DKI Jakarta      P1513
...                                          ...               ...        ...
           Makassar        12681         1612390  Sulawesi Selatan      P3388
                           12681         1612390  Sulawesi Selatan      P3082
                           12681         1612390  Sulawesi Selatan      P3354
                           12681         1612390  Sulawesi Selatan      P3357
                           12681         1612390  Sulawesi Selatan      P0422

                                          brand  quantity  item_price
order_date city            customer_id
2019-01-01 Jakarta Selatan 18055        BRAND_C         4     1934000
                           18055        BRAND_V         8      604000
                           18055        BRAND_G        12      747000
                           18055        BRAND_B        12      450000
                           18055        BRAND_G         3     1500000
...                                         ...       ...         ...
           Makassar        12681        BRAND_S        10      450000
                           12681        BRAND_R        18     1045000
                           12681        BRAND_S        24      450000
                           12681        BRAND_S        24      450000
                           12681        BRAND_B         4     1325000

[101 rows x 6 columns]

order_date  :  Index(['2019-01-01'], dtype='object', name='order_date')
city  :  Index(['Bogor', 'Jakarta Pusat', 'Jakarta Selatan', 'Jakarta Utara',
       'Makassar', 'Malang', 'Surabaya', 'Tangerang'],
      dtype='object', name='city')
customer_id  :  Int64Index([12681, 13963, 15649, 17091, 17228, 17450, 17470, 17511, 17616,
            18055],
           dtype='int64', name='customer_id')

# Indexing - Part 4

In [15]:
import pandas as pd
# Buat dataframe
df_week = pd.DataFrame({
    "day_number" : [1, 2, 3, 4, 5, 6,7],
    "week_type" : ["weekday" for i in range(5)] + ["weekend" for i in range(2)]
})
df_week.index = ["Mon", "Tue", "Wed", "Thu", "Fri", "Sat", "Sun"]
display(df_week)
display(df_week.reset_index(drop=True))

# Load dataset
df = pd.read_csv("https://storage.googleapis.com/dqlab-dataset/sample_tsv.tsv", sep="\t", nrows = 10)
display(df)
df.index = ["Pesanan ke - " + str(i) for i in range(1, 11)]
display(df)

     day_number week_type
Mon           1   weekday
Tue           2   weekday
Wed           3   weekday
Thu           4   weekday
Fri           5   weekday
Sat           6   weekend
Sun           7   weekend

   day_number week_type
0           1   weekday
1           2   weekday
2           3   weekday
3           4   weekday
4           5   weekday
5           6   weekend
6           7   weekend

,order_id,order_date,customer_id,city,province,product_id,brand,quantity,item_price
0,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0648,BRAND_C,4,1934000
1,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3826,BRAND_V,8,604000
2,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1508,BRAND_G,12,747000
3,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0520,BRAND_B,12,450000
4,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1513,BRAND_G,3,1500000
5,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3911,BRAND_V,3,2095000
6,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1780,BRAND_H,3,2095000
7,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3132,BRAND_S,3,1745000
8,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1342,BRAND_F,6,1045000
9,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P2556,BRAND_P,6,1045000

,order_id,order_date,customer_id,city,province,product_id,brand,quantity,item_price
Pesanan ke - 1,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0648,BRAND_C,4,1934000
Pesanan ke - 2,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3826,BRAND_V,8,604000
Pesanan ke - 3,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1508,BRAND_G,12,747000
Pesanan ke - 4,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0520,BRAND_B,12,450000
Pesanan ke - 5,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1513,BRAND_G,3,1500000
Pesanan ke - 6,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3911,BRAND_V,3,2095000
Pesanan ke - 7,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1780,BRAND_H,3,2095000
Pesanan ke - 8,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3132,BRAND_S,3,1745000
Pesanan ke - 9,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1342,BRAND_F,6,1045000
Pesanan ke - 10,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P2556,BRAND_P,6,1045000

# Indexing - Part 5

In [16]:
import pandas as pd
# Baca file sample.tsv dan set lah index_col sesuai instruksi
df = pd.read_csv("https://storage.googleapis.com/dqlab-dataset/sample_tsv.tsv", sep="\t", index_col = ["order_date"])
df_2 = pd.read_csv("https://storage.googleapis.com/dqlab-dataset/sample_tsv.tsv", sep="\t", index_col = ["order_date","order_id"])
df_set_index = pd.read_csv("https://storage.googleapis.com/dqlab-dataset/sample_tsv.tsv", sep="\t")
df_set_index = df_set_index.set_index(["order_date"])
display(df.head(10))
display(df_2.head(10))
display(df_set_index.head(10))

,order_id,customer_id,city,province,product_id,brand,quantity,item_price
order_date,,,,,,,,
2019-01-01,1612339,18055,Jakarta Selatan,DKI Jakarta,P0648,BRAND_C,4,1934000
2019-01-01,1612339,18055,Jakarta Selatan,DKI Jakarta,P3826,BRAND_V,8,604000
2019-01-01,1612339,18055,Jakarta Selatan,DKI Jakarta,P1508,BRAND_G,12,747000
2019-01-01,1612339,18055,Jakarta Selatan,DKI Jakarta,P0520,BRAND_B,12,450000
2019-01-01,1612339,18055,Jakarta Selatan,DKI Jakarta,P1513,BRAND_G,3,1500000
2019-01-01,1612339,18055,Jakarta Selatan,DKI Jakarta,P3911,BRAND_V,3,2095000
2019-01-01,1612339,18055,Jakarta Selatan,DKI Jakarta,P1780,BRAND_H,3,2095000
2019-01-01,1612339,18055,Jakarta Selatan,DKI Jakarta,P3132,BRAND_S,3,1745000
2019-01-01,1612339,18055,Jakarta Selatan,DKI Jakarta,P1342,BRAND_F,6,1045000
2019-01-01,1612339,18055,Jakarta Selatan,DKI Jakarta,P2556,BRAND_P,6,1045000

                     customer_id             city     province product_id  \
order_date order_id
2019-01-01 1612339         18055  Jakarta Selatan  DKI Jakarta      P0648
           1612339         18055  Jakarta Selatan  DKI Jakarta      P3826
           1612339         18055  Jakarta Selatan  DKI Jakarta      P1508
           1612339         18055  Jakarta Selatan  DKI Jakarta      P0520
           1612339         18055  Jakarta Selatan  DKI Jakarta      P1513
           1612339         18055  Jakarta Selatan  DKI Jakarta      P3911
           1612339         18055  Jakarta Selatan  DKI Jakarta      P1780
           1612339         18055  Jakarta Selatan  DKI Jakarta      P3132
           1612339         18055  Jakarta Selatan  DKI Jakarta      P1342
           1612339         18055  Jakarta Selatan  DKI Jakarta      P2556

                       brand  quantity  item_price
order_date order_id
2019-01-01 1612339   BRAND_C         4     1934000
           1612339   BRAND_V         8      604000
           1612339   BRAND_G        12      747000
           1612339   BRAND_B        12      450000
           1612339   BRAND_G         3     1500000
           1612339   BRAND_V         3     2095000
           1612339   BRAND_H         3     2095000
           1612339   BRAND_S         3     1745000
           1612339   BRAND_F         6     1045000
           1612339   BRAND_P         6     1045000

,order_id,customer_id,city,province,product_id,brand,quantity,item_price
order_date,,,,,,,,
2019-01-01,1612339,18055,Jakarta Selatan,DKI Jakarta,P0648,BRAND_C,4,1934000
2019-01-01,1612339,18055,Jakarta Selatan,DKI Jakarta,P3826,BRAND_V,8,604000
2019-01-01,1612339,18055,Jakarta Selatan,DKI Jakarta,P1508,BRAND_G,12,747000
2019-01-01,1612339,18055,Jakarta Selatan,DKI Jakarta,P0520,BRAND_B,12,450000
2019-01-01,1612339,18055,Jakarta Selatan,DKI Jakarta,P1513,BRAND_G,3,1500000
2019-01-01,1612339,18055,Jakarta Selatan,DKI Jakarta,P3911,BRAND_V,3,2095000
2019-01-01,1612339,18055,Jakarta Selatan,DKI Jakarta,P1780,BRAND_H,3,2095000
2019-01-01,1612339,18055,Jakarta Selatan,DKI Jakarta,P3132,BRAND_S,3,1745000
2019-01-01,1612339,18055,Jakarta Selatan,DKI Jakarta,P1342,BRAND_F,6,1045000
2019-01-01,1612339,18055,Jakarta Selatan,DKI Jakarta,P2556,BRAND_P,6,1045000

# Quiz

In [18]:
df_week = pd.DataFrame({'day_number':[1,2,3,4,5,6,7],
                        'week_type':['weekday' for i in range(5)] + ['weekend' for i in range(2)]
                       })
df_week_ix = ['Mon','Tue','Wed','Thu','Fri','Sat','Sun']
df_week.index = [df_week_ix, df_week['day_number'].to_list()]
df_week.index.names = ['name','num']
display(df_week)

          day_number week_type
name num
Mon  1             1   weekday
Tue  2             2   weekday
Wed  3             3   weekday
Thu  4             4   weekday
Fri  5             5   weekday
Sat  6             6   weekend
Sun  7             7   weekend

# Slicing Part - 1

In [23]:
import pandas as pd
from IPython.display import display

# Load dataset
df = pd.read_csv("https://storage.googleapis.com/dqlab-dataset/sample_csv.csv")
display(df.head(10))

# Slicing dataset
df_slice = df.loc[(df["order_date"] == "2019-01-01") & (df["product_id"].isin(["P2154","P2556"]))]
print("Slicing atau Filter berdasarkan kolom order_date dan product_id")
display(df_slice)

,order_id,order_date,customer_id,city,province,product_id,brand,quantity,item_price
0,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0648,BRAND_C,4,1934000
1,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3826,BRAND_V,8,604000
2,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1508,BRAND_G,12,747000
3,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0520,BRAND_B,12,450000
4,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1513,BRAND_G,3,1500000
5,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3911,BRAND_V,3,2095000
6,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1780,BRAND_H,3,2095000
7,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3132,BRAND_S,3,1745000
8,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1342,BRAND_F,6,1045000
9,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P2556,BRAND_P,6,1045000

Slicing atau Filter berdasarkan kolom order_date dan product_id

,order_id,order_date,customer_id,city,province,product_id,brand,quantity,item_price
9,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P2556,BRAND_P,6,1045000
10,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P2154,BRAND_M,4,1745000

In [25]:
# Load modul atau library
import pandas as pd
from IPython.display import display

# Load dataset
df = pd.read_csv("https://dqlab-dataset.s3-ap-southeast-1.amazonaws.com/sample_csv.csv")
display(df.head(5))

# Slicing dataset
df_slice = df.loc[(df["customer_id"] == "18055") & (df["product_id"].isin(["P0029","P0040","P0041","P0116","P0117"]))]
print("Slicing dataset df berdasarkan kolom customer_id dan product_id")
display(df_slice)

,order_id,order_date,customer_id,city,province,product_id,brand,quantity,item_price
0,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0648,BRAND_C,4,1934000
1,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3826,BRAND_V,8,604000
2,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1508,BRAND_G,12,747000
3,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0520,BRAND_B,12,450000
4,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1513,BRAND_G,3,1500000

Slicing dataset df berdasarkan kolom customer_id dan product_id

Empty DataFrame
Columns: [order_id, order_date, customer_id, city, province, product_id, brand, quantity, item_price]
Index: []

## Slicing - Part 2

In [30]:
# Load libaray atau modul
import pandas as pd
from IPython.display import display

# Load dataset
df = pd.read_csv("https://storage.googleapis.com/dqlab-dataset/sample_csv.csv")

# Mengeset index baru untuk dataset
df = df.set_index(["order_date","order_id","product_id"])

# Slicing 
df_slice = df.loc[("2019-01-01",1612339,["P2154","P2159"])]

display(df_slice.head(10))

                                customer_id             city     province  \
order_date order_id product_id
2019-01-01 1612339  P2154             18055  Jakarta Selatan  DKI Jakarta
                    P2159             18055  Jakarta Selatan  DKI Jakarta

                                  brand  quantity  item_price
order_date order_id product_id
2019-01-01 1612339  P2154       BRAND_M         4     1745000
                    P2159       BRAND_M        24      310000

## Quiz

In [38]:
## Load library atau modul
import pandas as pd
from IPython.display import display

# Load dataset
sample_csv = pd.read_csv("https://storage.googleapis.com/dqlab-dataset/sample_csv.csv")

# Set index dataset
sample_csv = sample_csv.set_index(["province","product_id"])
idx = pd.IndexSlice
sample_csv = sample_csv.sort_index().loc[idx["Sulawesi Selatan","P3082":"P3357"],:]
display(sample_csv)

                             order_id  order_date  customer_id      city  \
province         product_id
Sulawesi Selatan P3082        1612390  2019-01-01        12681  Makassar
                 P3354        1612390  2019-01-01        12681  Makassar
                 P3357        1612390  2019-01-01        12681  Makassar

                               brand  quantity  item_price
province         product_id
Sulawesi Selatan P3082       BRAND_R        18     1045000
                 P3354       BRAND_S        24      450000
                 P3357       BRAND_S        24      450000

## Transforming - Part 1

In [43]:
# Load library atau modul
import pandas as pd

# Load dataset
df = pd.read_csv("https://storage.googleapis.com/dqlab-dataset/sample_csv.csv")
display(df.head(10))
# Tipe dataset
display(df.dtypes)

# Merubah tipe data object menjadi datetime64
df["order_date"] = pd.to_datetime(df["order_date"])

# Tipe dataset
display(df.dtypes)
display(df.head(10))

,order_id,order_date,customer_id,city,province,product_id,brand,quantity,item_price
0,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0648,BRAND_C,4,1934000
1,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3826,BRAND_V,8,604000
2,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1508,BRAND_G,12,747000
3,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0520,BRAND_B,12,450000
4,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1513,BRAND_G,3,1500000
5,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3911,BRAND_V,3,2095000
6,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1780,BRAND_H,3,2095000
7,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3132,BRAND_S,3,1745000
8,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1342,BRAND_F,6,1045000
9,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P2556,BRAND_P,6,1045000

order_id        int64
order_date     object
customer_id     int64
city           object
province       object
product_id     object
brand          object
quantity        int64
item_price      int64
dtype: object

order_id                int64
order_date     datetime64[ns]
customer_id             int64
city                   object
province               object
product_id             object
brand                  object
quantity                int64
item_price              int64
dtype: object

,order_id,order_date,customer_id,city,province,product_id,brand,quantity,item_price
0,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0648,BRAND_C,4,1934000
1,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3826,BRAND_V,8,604000
2,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1508,BRAND_G,12,747000
3,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0520,BRAND_B,12,450000
4,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1513,BRAND_G,3,1500000
5,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3911,BRAND_V,3,2095000
6,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1780,BRAND_H,3,2095000
7,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3132,BRAND_S,3,1745000
8,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1342,BRAND_F,6,1045000
9,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P2556,BRAND_P,6,1045000

## Transforming - Part 2

In [48]:
# Load library atau modul
import pandas as pd

# Load dataset
df = pd.read_csv("https://storage.googleapis.com/dqlab-dataset/sample_csv.csv")

# Tipe dataset
display(df.dtypes)

# Ubah int64 -> float64
df["quantity"] = pd.to_numeric(df["quantity"], downcast="float")

# Ubah object -> category
df["city"] = df["city"].astype("category")


# Tipe dataset
display(df.dtypes)

order_id        int64
order_date     object
customer_id     int64
city           object
province       object
product_id     object
brand          object
quantity        int64
item_price      int64
dtype: object

order_id          int64
order_date       object
customer_id       int64
city           category
province         object
product_id       object
brand            object
quantity        float32
item_price        int64
dtype: object

## Transforming - Part 3

In [52]:
# Load dataset
import pandas as pd
from IPython.display import display

# Load dataset
df = pd.read_csv("https://storage.googleapis.com/dqlab-dataset/sample_csv.csv")
display(df.head(10))

# Mengubah data brand menjadi huruf kecil semua
df["brand"] = df["brand"].apply(lambda x : x.lower())

# Mengubah data brand menjadi huruf terakhir saja
df["brand"] = df["brand"].map(lambda x : x[-1])

display(df.head(10))

,order_id,order_date,customer_id,city,province,product_id,brand,quantity,item_price
0,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0648,BRAND_C,4,1934000
1,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3826,BRAND_V,8,604000
2,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1508,BRAND_G,12,747000
3,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0520,BRAND_B,12,450000
4,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1513,BRAND_G,3,1500000
5,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3911,BRAND_V,3,2095000
6,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1780,BRAND_H,3,2095000
7,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3132,BRAND_S,3,1745000
8,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1342,BRAND_F,6,1045000
9,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P2556,BRAND_P,6,1045000

,order_id,order_date,customer_id,city,province,product_id,brand,quantity,item_price
0,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0648,c,4,1934000
1,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3826,v,8,604000
2,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1508,g,12,747000
3,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0520,b,12,450000
4,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1513,g,3,1500000
5,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3911,v,3,2095000
6,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1780,h,3,2095000
7,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3132,s,3,1745000
8,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1342,f,6,1045000
9,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P2556,p,6,1045000

## Transforming Part 4

In [1]:
# Load library atau modul
import pandas as pd
import numpy as np

# Membuat angka random menjadi sama ketika di run berulang kali
np.random.seed(1234)

# Membuat data random 3 baris 4 kolom
df_tr = pd.DataFrame(np.random.rand(3,4))
display(df_tr)

# Membuat data di masing-masing kolom menjadi x^2 + 3x + 2 -> applymap()
df_tr1 = df_tr.applymap(lambda x : x**2 + 3*x + 2)
display(df_tr1)


# Membuat data di masing-masing kolom menjadi x^2 + 3x + 2 -> function
def quadratic_fun(x):
    return x**2 + 3*x + 2
df_tr2 = df_tr.applymap(quadratic_fun)
display(df_tr2)

          0         1         2         3
0  0.191519  0.622109  0.437728  0.785359
1  0.779976  0.272593  0.276464  0.801872
2  0.958139  0.875933  0.357817  0.500995

          0         1         2         3
0  2.611238  4.253346  3.504789  4.972864
1  4.948290  2.892085  2.905825  5.048616
2  5.792449  5.395056  3.201485  3.753981

          0         1         2         3
0  2.611238  4.253346  3.504789  4.972864
1  4.948290  2.892085  2.905825  5.048616
2  5.792449  5.395056  3.201485  3.753981

# Handling Missing Value

## Inspeksi Missing Value

In [11]:
# Load library 
import pandas as pd 
from IPython.display import display

# Load dataset
df = pd.read_csv("https://storage.googleapis.com/dqlab-dataset/CHAPTER%204%20-%20missing%20value%20-%20public%20data%20covid19%20.csv")
# df.to_csv(r"D:\Usep Syaikal Arifin\Computer Programming\Python Programming Language\DQLab-Academy-Course-Online\Kelas Fundamental\Data Manipulation With Pandas - Part 1\File Dokumentasi\File CSV\chapter_20_missing_value_public_data_covid_20.csv", index = None, header=True)
# df.to_excel(r"D:\Usep Syaikal Arifin\Computer Programming\Python Programming Language\DQLab-Academy-Course-Online\Kelas Fundamental\Data Manipulation With Pandas - Part 1\File Dokumentasi\File Excel\chapter_20_missing_value_public_data_covid_20.xlsx", index=None, header=True)

# Informasi dataset
print("Informasi dataset : ")
display(df.info())

# Informasi missing value
mv = df.isna().sum()
print("Informasi missing value : ")
display(mv)

Informasi dataset :
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   province_state  960 non-null    object
 1   country_region  1000 non-null   object
 2   date            1000 non-null   object
 3   latitude        874 non-null    float64
 4   longitude       874 non-null    float64
 5   location_geom   874 non-null    object
 6   confirmed       1000 non-null   int64
 7   deaths          999 non-null    float64
 8   recovered       999 non-null    float64
 9   active          949 non-null    float64
 10  fips            949 non-null    float64
 11  admin2          842 non-null    object
 12  combined_key    0 non-null      float64
dtypes: float64(7), int64(1), object(5)
memory usage: 101.7+ KB

None

Informasi missing value :

province_state      40
country_region       0
date                 0
latitude           126
longitude          126
location_geom      126
confirmed            0
deaths               1
recovered            1
active              51
fips                51
admin2             158
combined_key      1000
dtype: int64

## Treatment Missing Value
### 1. Membiarkan saja
### 2. Menghapus kolom atau baris
### 3. Imputasi dengan nilai yang sudah ditentukan dengan metode tertentu seperti :
#### 3.1 Nilai Statistik Mean atau Media
#### 3.2 Interpolasi Data
#### 3.3 Text Tertentu

In [19]:
# Load library atau modul
df = pd.read_csv("https://storage.googleapis.com/dqlab-dataset/CHAPTER%204%20-%20missing%20value%20-%20public%20data%20covid19%20.csv")
display(df.head(5))

# Cek dimensi dataset sebelum di treatment
print("Dimensi dataset sebelum di Treatment adalah = %d Baris & %d Kolom \n" %df.shape)

# drop kolom yang mengandung missing kolom 
df = df.dropna(axis=1, how="all")

# Cek dimensi dataset setelah di treatment
print("Dimensi dataset setelah di Treatment adalah = %d Baris & %d Kolom \n" %df.shape)

# drop baris yang mengandung missing value
df = df.dropna(axis=0, how="any")

# Cek dimensi dataset setelah di treatment
print("Dimensi dataset setelah di Treatment adalah = %d Baris & %d Kolom \n" %df.shape)

,province_state,country_region,date,latitude,longitude,location_geom,confirmed,deaths,recovered,active,fips,admin2,combined_key
0,NaN,UK,01-02-20,NaN,NaN,NaN,2,0.0,0.0,NaN,NaN,NaN,NaN
1,NaN,UK,18-02-20,NaN,NaN,NaN,9,0.0,8.0,NaN,NaN,NaN,NaN
2,NaN,UK,17-02-20,NaN,NaN,NaN,9,0.0,8.0,NaN,NaN,NaN,NaN
3,NaN,UK,31-01-20,NaN,NaN,NaN,2,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,UK,19-02-20,NaN,NaN,NaN,9,0.0,8.0,NaN,NaN,NaN,NaN

Dimensi dataset sebelum di Treatment adalah = 1000 Baris & 13 Kolom

Dimensi dataset setelah di Treatment adalah = 1000 Baris & 12 Kolom

Dimensi dataset setelah di Treatment adalah = 746 Baris & 12 Kolom

In [23]:
# Load library
import pandas as pd
from IPython.display import display

# Load dataset
df = pd.read_csv("https://storage.googleapis.com/dqlab-dataset/CHAPTER%204%20-%20missing%20value%20-%20public%20data%20covid19%20.csv")
df.head(5)

# Cek nilai unique pada kolom province_state
print("Unique value awal sebelum di Imputasi: ")
display(df["province_state"].unique())

# Imputasi missing value pada kolom province_state
df["province_state"] = df["province_state"].fillna("unknow_province_state")

print("Unique value awal setelah di Imputasi: \n")
display(df["province_state"].unique())

Unique value awal sebelum di Imputasi:

array([nan, 'US', 'Guam', 'Iowa'], dtype=object)

Unique value awal setelah di Imputasi:

array(['unknow_province_state', 'US', 'Guam', 'Iowa'], dtype=object)

In [34]:
# Load library atau modul
import pandas as pd
from IPython.display import display

# Load dataset
df = pd.read_csv("https://storage.googleapis.com/dqlab-dataset/CHAPTER%204%20-%20missing%20value%20-%20public%20data%20covid19%20.csv")
display(df.head(5))

# Cetak nilai awal mean dan median awal
print("Nilai statistik mean & median")
display("Awal : mean = %f, median = %f."%(df["active"].mean(), df["active"].median()))

# Imputasi missing value dengan median()
df_median = df["active"].fillna(df["active"].median())
display(df_median.head(5))

# Cetak nilai median setelah di imputasi
print("Nilai statistik mean & median")
display("df_median : mean = %f, median = %f."%(df_median.mean(), df_median.median()))

# Imputasi missing value dengan mean()
df_mean = df["active"].fillna(df["active"].mean())
display(df_mean.head(5))

# Cetak nilai median setelah di imputasi
print("Nilai statistik mean & median")
display("df_mean : mean = %f, median = %f."%(df_mean.mean(), df_mean.median()))

,province_state,country_region,date,latitude,longitude,location_geom,confirmed,deaths,recovered,active,fips,admin2,combined_key
0,NaN,UK,01-02-20,NaN,NaN,NaN,2,0.0,0.0,NaN,NaN,NaN,NaN
1,NaN,UK,18-02-20,NaN,NaN,NaN,9,0.0,8.0,NaN,NaN,NaN,NaN
2,NaN,UK,17-02-20,NaN,NaN,NaN,9,0.0,8.0,NaN,NaN,NaN,NaN
3,NaN,UK,31-01-20,NaN,NaN,NaN,2,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,UK,19-02-20,NaN,NaN,NaN,9,0.0,8.0,NaN,NaN,NaN,NaN

Nilai statistik mean & median

'Awal : mean = 192.571128, median = 41.000000.'

0    41.0
1    41.0
2    41.0
3    41.0
4    41.0
Name: active, dtype: float64

Nilai statistik mean & median

'df_median : mean = 184.841000, median = 41.000000.'

0    192.571128
1    192.571128
2    192.571128
3    192.571128
4    192.571128
Name: active, dtype: float64

Nilai statistik mean & median

'df_mean : mean = 192.571128, median = 49.000000.'

## Interpolate Missing Value

In [37]:
# Load library atau modul
import numpy as np
import pandas as pd

# Load dataset
# Data
ts = pd.Series({
   "2020-01-01":9,
   "2020-01-02":np.nan,
   "2020-01-05":np.nan,
   "2020-01-07":24,
   "2020-01-10":np.nan,
   "2020-01-12":np.nan,
   "2020-01-15":33,
   "2020-01-17":np.nan,
   "2020-01-16":40,
   "2020-01-20":45,
   "2020-01-22":52,
   "2020-01-25":75,
   "2020-01-28":np.nan,
   "2020-01-30":np.nan
})
display(ts)

# Impute missing value dengan Interpolate
ts = ts.interpolate()

# Cek dataset setelah interpolate
display(ts)

2020-01-01     9.0
2020-01-02     NaN
2020-01-05     NaN
2020-01-07    24.0
2020-01-10     NaN
2020-01-12     NaN
2020-01-15    33.0
2020-01-17     NaN
2020-01-16    40.0
2020-01-20    45.0
2020-01-22    52.0
2020-01-25    75.0
2020-01-28     NaN
2020-01-30     NaN
dtype: float64

2020-01-01     9.0
2020-01-02    14.0
2020-01-05    19.0
2020-01-07    24.0
2020-01-10    27.0
2020-01-12    30.0
2020-01-15    33.0
2020-01-17    36.5
2020-01-16    40.0
2020-01-20    45.0
2020-01-22    52.0
2020-01-25    75.0
2020-01-28    75.0
2020-01-30    75.0
dtype: float64